app/controllers/carts_controller.rb

  def index
    @carts = Cart.all
---
SELECT "carts".* FROM "carts"

  def destroy
    @cart.destroy if @cart.id == session[:cart_id]
---
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 1]]

    def set_cart
      @cart = Cart.find(params[:id])
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]