app/controllers/line_items_controller.rb

SELECT "line_items".* FROM "line_items"
---
  def index
    @line_items = LineItem.all

SELECT "instruments".* FROM "instruments" WHERE "instruments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "line_items" ("instrument_id", "cart_id", "created_at", "updated_at", "quantity") VALUES (?, ?, ?, ?, ?)  [["instrument_id", 1], ["cart_id", 1], ["created_at", "2023-05-01 06:30:41.040397"], ["updated_at", "2023-05-01 06:30:41.040397"], ["quantity", 1]]
UPDATE "line_items" SET "updated_at" = ?, "quantity" = ? WHERE "line_items"."id" = ?  [["updated_at", "2023-05-01 06:32:01.190370"], ["quantity", 2], ["id", 1]]
---
  def create
    instrument = Instrument.find(params[:instrument_id])
    @line_item = @cart.add_instrument(instrument)

    respond_to do |format|
      if @line_item.save

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 3]]
---
  def destroy
    @cart = Cart.find(session[:cart_id])
    @line_item.destroy

SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_line_item
      @line_item = LineItem.find(params[:id])